# alert = "❕"
# line = "➖"*11
info = "💬"
from utils.db_api.models import Page

hello_text = f"<b>🏪️AutoShop ᗷᒪᐺᑢᖽᐸ°•ᖇᗩᗷᗷᓰᖶ</b>"
hello_text_body = f"<b>Добро пожаловать!</b>\n\n<code>🔞 Внимание! Лицам не достигшим совершеннолетнего  возраста котегорический запрещено пользоваться данным сервисом 🔞</code>\n➖➖➖➖➖➖➖➖\n<b>•🔗 Удобная навигация , мгновенная выдача и полная анонимность\n• 💸 Удобное пополнение расширенные возможности пополнения Qiwi ,QiwiP2P, Visa\n•💯 Гарантия качества и надёжность сделки</b>"
catalog_text = f"<b>🗃 Товары</b>"

catalog_text_body = f"Широкий ассортимент, постоянное пополнение, скидки постоянным покупателям."

about_text = f"<b>📕 О магазине</b>"

about_text_body = f"Широкий ассортимент, постоянное пополнение, скидки постоянным покупателям."



